aethaniel/ExperimentalCore-sam/tools/CMSIS_SVD/ATSAMD21G1xAU.svd
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OVR0</name>
              <description>Channel 0 Overrun</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR1</name>
              <description>Channel 1 Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR2</name>
              <description>Channel 2 Overrun</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR3</name>
              <description>Channel 3 Overrun</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR4</name>
              <description>Channel 4 Overrun</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR5</name>
              <description>Channel 5 Overrun</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR6</name>
              <description>Channel 6 Overrun</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR7</name>
              <description>Channel 7 Overrun</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD0</name>
              <description>Channel 0 Event Detection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD1</name>
              <description>Channel 1 Event Detection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD2</name>
              <description>Channel 2 Event Detection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD3</name>
              <description>Channel 3 Event Detection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD4</name>
              <description>Channel 4 Event Detection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD5</name>
              <description>Channel 5 Event Detection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD6</name>
              <description>Channel 6 Event Detection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD7</name>
              <description>Channel 7 Event Detection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR8</name>
              <description>Channel 8 Overrun</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR9</name>
              <description>Channel 9 Overrun</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR10</name>
              <description>Channel 10 Overrun</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR11</name>
              <description>Channel 11 Overrun</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD8</name>
              <description>Channel 8 Event Detection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD9</name>
              <description>Channel 9 Event Detection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD10</name>
              <description>Channel 10 Event Detection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD11</name>
              <description>Channel 11 Event Detection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USER</name>
          <description>User Multiplexer</description>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USER</name>
              <description>User Multiplexer Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CHANNEL</name>
              <description>Channel Event Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>CHANNELSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No Channel Output Selected</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
